In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df=pd.read_excel('data.xlsx')

#### Data has to be cleaned because there are duplicates

#### ----------------------------------------------------------------------------------------------------------------------------------------------------

In [38]:
# Removing duplicated dates
df = df.drop_duplicates('Date', keep='first')

#### ----------------------------------------------------------------------------------------------------------------------------------------------------

##### Which month has higher sales than the rest

In [40]:
df.groupby('Month')[['Sales']].sum().sort_values(by='Sales', ascending=False)

       Sales
Month
Oct    59700
Apr    55000
Aug    52000
Jul    44800
May    34500
Jun    34300
Jan    34000
Sep    33700
Dec    33600
Feb    30300
Nov    11000
Mar     7100

##### In that month with higher sales which day of the week has higher sales

In [41]:
oct = df[df['Month']=='Oct']

In [42]:
oct.groupby('Day')[['Sales']].sum().sort_values(by='Sales', ascending=False)

     Sales
Day
Fri  21200
Wed  10100
Thu   9800
Sun   9300
Mon   4900
Tue   4400

##### Which day normally has higher sales throughtout the year? and what is that amount per day

In [43]:
df.groupby('Day')[['Sales']].mean().sort_values(by='Sales', ascending=False)

           Sales
Day
Tue  5558.333333
Thu  5200.000000
Sun  5192.307692
Wed  4854.545455
Fri  4793.333333
Sat  4433.333333
Mon  4111.111111